{
  "nav": {
    "titleGoal": "Bonjour, I'm Jade",
    "titleProjects": "Samples of my work",
    "titleAbout": "A little bit more about me",
    "goal": "Goal",
    "projects": "Projects",
    "about": "About"
  },
  "goal": {
    "title": "Software Developer & Project Manager",
    "purpose": "My Purpose",
    "purposeText": "Built software to help companies to automate their processes, do better monitoring and help them to make decisions through their data 📊.",
    "subtitle1": "Monitoring",
    "subtitle1Text": "It is important for companies to be reactive in this fast modern world 🌍. Monitoring processes and indicators with the help of software can assist to catch issues before they happen. While working as a quality manager, I was able to see how motoring can help to save money and time 🕖. That's why as a software developer I am trying to create simple and efficient dashboards for monitoring.",
    "subtitle2": "Automate",
    "subtitle2Text": "It happens frequently that teams are under pressure with an important amount of workload 🗃️. Softwares can automate some taks in order to save time, be more efficient and allocate time to more complex tasks. 🔎 I like to audit processes and search which IT tool I can implement to help teams in their daily tasks.",
    "subtitle3": "Decision helper",
    "subtitle3Text": "Nowadays, we receive thousands of data in a week 🔢. I like to get revelant information from this data to help teams to take decision with for instance KPI indicators. IA can be from a great tool also to assist to take decision 🤖."
  },
  "about": {
    "title1": "“Simple & Efficace”",
    "title1Text": "Throughout my career as a quality manager for food companies, I have often wanted to be able to <span class='font-semibold'>code tools</span> that would allow me to automate and do better monitoring. Back from my four-year stay in the United States, I decided to take the plunge and obtain a <span class='font-semibold'>computer science degree</span>. <div class='mb-1'><br /></div> Today I am happy to be able to make the link between my knowledge in <span class='font-semibold'>quality management</span> and the one in <span class='font-semibold'>software development</span>. I am currently creating simple and efficient software to help teams in their daily tasks and to take decisions in the long term.",
    "title2": "My double experience as a Quality Manager & a Software Developer",
    "dawan": {
      "title": "Software Developer",
      "dates": "September 2020 – December 2021",
      "company": "Dawan - Consulting & IT training center",
      "location": "Paris (France)",
      "tasks1": "Built a planning application, for a training center, to help both the Sales and the HR team to keep track of trainers’ schedules and the list of courses sold (Java / Vue.js)",
      "tasks2": "Created the planning Android application connected to the Rest API with Retrofit for non-admin users",
      "tasks3": "Built a calendar application for the HR team to replace their spreadsheet used as an employee scheduling solution (C# / Vue.js)",
      "tasks4": "Developed a web scraping program with Selenium to help a company to analyze the market (Java / Angular)"
    },
    "cuisine": {
      "title": "Quality Manager",
      "dates": "August 2016 – June 2020",
      "company": "Cuisine Solutions - Sous-Vide food company",
      "location": "Alexandria - VA (the U.S.A)",
      "tasks1": "Ensured BRC level AA, Organic, ABF, Halal and Gluten-Free certifications, FDA / USDA inspections and customer audits for the plant in Alexandria (Virginia). Traveled also to different factories (the United States and Thailand) to provide technical assistance to help them to prepare their audits",
      "tasks2": "Managed a quality team with 13 persons (2 managers, 3 supervisors, and 8 technicians)",
      "tasks3": "Worked with the R&D team to develop new products (from supplier approval to packaging creation)",
      "tasks4": "Reported the performance of the quality system to senior management during quarterly reviews"
    },
    "florette": {
      "title": "Quality Assistant Manager",
      "dates": "August 2016 – June 2020",
      "company": "Florette - Fresh food company",
      "location": "Lessay (France)",
      "tasks1": "Performed internal audits, prepared and participated in external audits (customer audits and IFS/BRC audit)",
      "tasks2": "Trained and monitored 11 new quality controllers, managed their schedule, and followed up their projects",
      "tasks3": "Collected data, followed and presented KPIs to the Management Team"
    },
    "neuhauser": {
      "title": "Quality Assistant Manager",
      "dates": "January 2015 – May 2015",
      "company": "Neuhauser - Fresh & frozen bakery products",
      "location": "Maubeuge (France)",
      "tasks1": "Managed internal non-conformities and complaints to suppliers",
      "tasks2": "Monitored and managed customer satisfaction: customer complaints, specifications, create and update final specifications",
      "tasks3": "Helped to create new products (production and quality records to create, final specification and packaging)"
    },
    "title3": "Education along the way",
    "dawanSchool": {
      "title": "Computer Science degree - Apprenticeship program",
      "dates": "September 2020 - December 2021",
      "coursework": "<span class='font-bold'>Relevant Coursework : </span> Object-oriented programming, design patterns, software development, mobile development, database and information systems, test-driven development, agile software projects"
    },
    "bsaSchool": {
      "title": "Master of Agriculture and Food Sciences",
      "dates": "September 2011 – September 2014",
      "coursework": "<span class='font-bold'>Relevant Coursework : </span> Quality, Integrated Management and Sustainable Development, QSE Management tools for engineers in food value chains, Business Economics"
    },
    "title4": "Contact me through LinkedIn"
  },
  "project": {
    "title": "Projects list",
    "planningWeb1": "Built",
    "planningWeb2": "a planning application",
    "planningWeb3": "(Java / Vue.js) for a training center to help both the Sales and the HR teams keep track of trainers’ schedules and the list of courses available for sales ;",
    "planningAndroid1": "Developed an",
    "planningAndroid2": "Android application",
    "planningAndroid3": "(Java) of the planning for non-admin users ;",
    "calendar": "Built a calendar application for the HR team (C# / Vue.js) ;",
    "comparator": "Developed a web scraping program with Selenium to analyze the competitive market (Java / Angular) ;",
    "quality1": "Created a computerized",
    "quality2": "quality management system",
    "portfolio1": "Coded",
    "portfolio2": "a portfolio",
    "portfolio3": "(Vue.js) to explain how I am using my knowledge in project & quality management with software development."
  },
  "portfolio": {
    "title": "Project - Personal Portfolio",
    "subtitle1": "Design",
    "subtitle2": "Technologies used",
    "subtitle3": "You can find the code on Github"
  },
  "quality": {
    "title": "Project - Quality management system design",
    "subtitle1": "❔ The Issue",
    "subtitle1Text": "How to help quality teams with their daily tasks while preparing for audits during the year ?",
    "subtitle2": "🎯 The Goals",
    "subtitle2Monitoring": "<span class='font-semibold'>Monitoring :</span> Dashboard, alert NC not claused or when recurrence of a NC",
    "subtitle2Automate": "<span class='font-semibold'>Automate :</span> send email, organize documents received from suppliers, use API from suppliers like laboratory.",
    "subtitle2Decision": "<span class='font-semibold'>Decision helper :</span> Quarterly review, KPI indicators, follow up on audit preparation, IA to follow some sensitive processes",
    "subtitle3": "✔️ Solutions",
    "subtitle3Monitoring": "<span class='font-semibold'>Monitoring :</span> Dashboard for QA team, notify managers immediately when there is a quality issue, different pages : suppliers, food fraud, trainings, etc.",
    "subtitle3Automate": "<span class='font-semibold'>Automate :</span> send email, organize documents received from suppliers, use API from suppliers like laboratory.",
    "supplierEmail": "Send automatically emails to suppliers",
    "supplierFile": "Save files from suppliers in their folders",
    "notification": "Notify QA team to review new documents",
    "subtitle3Decision": "<span class='font-semibold'>Decision helper :</span> Quarterly review, KPI indicators, follow up on audit preparation, IA to follow some sensitive processes."
  }
}