{
  "nav": {
    "titleGoal": "Hi, je m'appelle Jade",
    "titleProjects": "Mes projets",
    "titleAbout": "Un peu plus sur moi",
    "goal": "Objectifs",
    "projects": "Projets",
    "about": "À propos",
    "goBack": "Retour",
    "notFound": " Cette page n'a pas pu être trouvée.",
    "backMainPage": "Revenir à la page principale"
  },
  "goal": {
    "title": "Concepteur & Développeur de Logiciel",
    "subtitle": "avec une expérience en qualité",
    "purpose": "Mon but",
    "purposeText": "Mon objectif est de créer des logiciels qui aident les entreprises à automatiser leurs processus et mieux surveiller leurs opérations dans un système d'amélioration continue ✔️.",
    "subtitle1": "Surveillance & Visualisation des Données",
    "subtitle1Text": "Il est important que les entreprises soient proactives dans ce monde moderne et rapide 🌍. Le suivi des processus et des indicateurs à l'aide d'un logiciel peut aider les équipes à détecter les problèmes avant qu'ils ne surviennent. En travaillant en tant que responsable qualité, j'ai pu aider les entreprises à sauver du temps 🕖 et de l'argent en surveillant les opérations du quotidien. C'est pourquoi, en tant que développeur de logiciels, j'essaie de créer des tableaux de bord simples et efficaces qui fournissent des informations pertinentes.",
    "subtitle2": "Automatiser",
    "subtitle2Text": "Il arrive fréquemment que les équipes soient sous pression avec une charge de travail importante 🗃️. Les logiciels peuvent automatiser les tâches répétitives afin de gagner du temps, d'améliorer l'efficacité et de libérer du temps pour des tâches plus complexes. 🔎 J'aime auditer les processus et intégrer des outils de productivité pour aider les équipes dans leurs tâches quotidiennes.",
    "subtitle3": "Amélioration continue",
    "subtitle3Text": "La mise en place de processus qualité permet de prévenir les problèmes, ou de s'assurer qu'ils ne se reproduiront pas, en utilisant des actions préventives, une analyse des causes et une participation collaborative 🤝. L'amélioration continue intègre également le CI/CD, le principe agile, les tests logiciels et le partage des connaissances au sein de l'entreprise.",
    "projectsList": "Découvrez quelques-uns de mes projets!"
  },
  "about": {
    "title1": "“Simple & Efficace”",
    "title1Text": "Tout au long de ma carrière de responsable qualité pour des entreprises agroalimentaires, j'ai souvent souhaité pouvoir <span class='font-semibold'>coder des outils</span> qui me permettraient d'automatiser et de faire un meilleur suivi. De retour de mon séjour de quatre ans aux États-Unis, j'ai décidé de franchir le pas et d'obtenir un <span class='font-semibold'>diplôme en informatique</span>. <div class='mb-1'><br /></div> Aujourd'hui je suis heureuse de pouvoir faire le lien entre mes connaissances en <span class='font-semibold'>gestion de la qualité</span> et celles en <span class='font-semibold'>développement de logiciel</span>. Je créé actuellement des logiciels simples et efficaces pour aider les équipes dans leurs tâches quotidiennes et les accompagner à prendre des décisions.",
    "title2": "Ma double expérience en tant que Responsable Qualité & Développeur Logiciel",
    "dawan": {
      "title": "Full Stack Développeur",
      "dates": "Septembre 2020 – Décembre 2021",
      "company": "Dawan - Centre de conseil et de formation IT",
      "location": "Paris (France)",
      "tasks1": "Création d'une application de planification, pour un centre de formation, pour aider à la fois l'équipe commerciale et l'équipe RH à suivre les horaires des formateurs et la liste des cours vendus (Java / Vue.js)",
      "tasks2": "Création de l'application Android de planification connectée à l'API Rest avec Retrofit pour les utilisateurs non administrateurs",
      "tasks3": "Création d'une application de calendrier pour l'équipe RH afin de remplacer leur feuille de calcul utilisée comme solution de planification des employés (C# / Vue.js)",
      "tasks4": "Développement d'un programme de web scraping avec Selenium pour aider une entreprise à analyser le marché (Java / Angular)"
    },
    "cuisine": {
      "title": "Responsable qualité",
      "dates": "Août 2016 – Juin 2020",
      "company": "Cuisine Solutions - Produits Sous-Vide",
      "location": "Alexandria - Virginia (U.S)",
      "tasks1": "Certifications BRC niveau AA, Biologique, ABF, Halal et Sans Gluten, inspections FDA/USDA et audits clients pour l'usine d'Alexandrie (Virginie). Déplacement également dans différentes usines (États-Unis et Thaïlande) pour apporter une assistance technique afin de les aider à préparer leurs audits", 
      "tasks2": "Management d'une équipe qualité de 13 personnes (2 managers, 3 superviseurs et 8 techniciens)",
      "tasks3": "Travailler avec le département R&D pour développer les nouveauxproduits (du choix des fournisseurs jusqu’à la validation du produit fini).",
      "tasks4": "Rendre compte de la performance du système qualité à la haute direction lors des revues trimestrielles"
    },
    "florette": {
      "title": "Assistante Responsable Qualité",
      "dates": "Août 2016 – Juin 2020",
      "company": "Florette - Produits frais",
      "location": "Lessay (France)",
      "tasks1": "Réalisation d'audits internes, préparation et participation à des audits externes (audits clients et audit IFS/BRC)",
      "tasks2": "Formation et suivi de 11 nouveaux contrôleurs qualité, gestion de leur planning et suivi de leurs projets",
      "tasks3": "Collecte des données, suivi et présentation des KPI à l'équipe de direction"
    },
    "neuhauser": {
      "title": "Assistante Responsable Qualité",
      "dates": "Janvier 2015 – Mai 2015",
      "company": "Neuhauser - Produits de boulangerie frais et surgelés",
      "location": "Maubeuge (France)",
      "tasks1": "Gestion des non-conformités internes et des réclamations aux fournisseurs",
      "tasks2": "Suivi et gestion de la satisfaction client : réclamations clients, cahier des charges, création et mise à jour du cahier des charges final",
      "tasks3": "Aide à la création de nouveaux produits (enregistrements de production et de qualité à créer, spécification finale et emballage)"
    },
    "title3": "Parcours scolaire",
    "dawanSchool": {
      "title": "Titre Professionnel - Programme d'apprentissage",
      "dates": "Septembre 2020 - Décembre 2021",
      "coursework": "<span class='font-bold'>Cours pertinents : </span> Programmation orientée objet, modèles de conception, développement logiciel, développement mobile, bases de données et systèmes d'information, développement piloté par les tests, projets logiciels agiles"
    },
    "bsaSchool": {
      "title": "Ingénieur Agronome",
      "dates": "Septembre 2011 – Septembre 2014",
      "coursework": "<span class='font-bold'>Cours pertinents : </span> Qualité, Management Intégré et Développement Durable, Outils de management QSE pour les ingénieurs des filières alimentaires, Economie d'entreprise"
    },
    "skills": "<span class='font-bold'>Technologies connues :</span> HTML/CSS, JavaScript, TypeScript, Vue.js, Angular, C#, ASP.NET, Java, Spring Boot, Android, SQL (SQL Server, MySQL , PostgreSQL), tests (Jest / Nightwatch / JUnit / JMeter), API Rest, WebSocket, Git, Figma, Notion.",
    "title4": "Contactez-moi via LinkedIn"
  },
  "project": {
    "title": "Liste des projets",
    "subtitle1": "Projets professionnels",
    "subtitle2": "Projets personnels",
    "planningWeb1": "Construire",
    "planningWeb2": "une application de planification",
    "planningWeb3": "(Java / Vue.js) pour un centre de formation afin d'aider à la fois les équipes commerciales et les équipes RH à suivre les plannings des formateurs et la liste des formations disponibles à la vente",
    "planningAndroid1": "Développer une",
    "planningAndroid2": "application Android",
    "planningAndroid3": "(Java) de l'application de planification pour les utilisateurs non-admin",
    "calendar": "Créer une application de calendrier pour l'équipe RH (C# / Vue.js)",
    "comparator": "Développer un programme de web scraping avec Selenium pour analyser le marché concurrentiel (Java / Angular)",
    "quality1": "Créer un ",
    "quality2": "système informatisé de gestion de la qualité",
    "quality3": "pour des entreprises agroalimentaire",
    "portfolio1": "Coder",
    "portfolio2": "un portfolio",
    "portfolio3": "(Vue.js) pour expliquer comment j'utilise mes connaissances en gestion de projet et de la qualité pour développer des logiciels"
  },
  "portfolio": {
    "title": "Projet personnel - Portfolio",
    "subtitle1": "Conception",
    "subtitle2": "Technologies utilisées",
    "subtitle3": "Vous trouverez le code sur Github"
  },
  "quality": {
    "title": "Projet personnel - Conception du système de management de la qualité",
    "subtitle1": "❔ Le Problème",
    "subtitle1Text": "Comment aider les équipes qualité dans leurs tâches quotidiennes tout en préparant les audits en cours d'année ?",
    "subtitle3": "✔️ Solutions",
    "subtitle3Monitoring": "<span class='font-semibold'>Suivi :</span> créer un tableau de bord pour l'équipe QA, informer immédiatement les responsables en cas de problème de qualité, créer différentes pages pour gérer les fournisseurs, la fraude alimentaire, les formations, etc.",
    "subtitle3PowerBI": "Logiciel synchronisé avec PowerBI pour obtenir rapidement les rapports trimestriels :",
    "subtitle3Automate": "<span class='font-semibold'>Automatisation :</span> automatiser en utilisant des logiciels internes, des applications externes (Teams, Outlook, etc.) et l'API des fournisseurs.",
    "supplierEmail": "Envoyer automatiquement des e-mails aux fournisseurs",
    "supplierFile": "Enregistrer les fichiers des fournisseurs dans leurs dossiers",
    "notification": "Notifier l'équipe d'assurance qualité pour qu'elle examine les nouveaux documents",
    "subtitle3Decision": "<span class='font-semibold'>Amélioration continue :</span> alerte lorsque les non-conformités ne sont pas closes, ou lorsqu'il y a une récurrence avec une non-conformité, suivi des réclamations et des problèmes rencontrés sur le terrain"
  },
  "planning-web": {
    "title": "Projet Entreprise - Application de Planification  (Java / Vue.js)",
    "issueText": "L'entreprise utilisait un fichier CSV comme outil de gestion de planification. Cependant, il n'était pas facile de suivre les modifications et l'entreprise ne pouvait pas améliorer le fichier pour répondre à ses nouveaux besoins (connexion à un webservice existant, application en temps réel, envoie du calendrier aux formateurs en format .ics, etc.).",
    "solutionText": "Création d'une application web facile à utiliser, plus lisible et synchronisable lorsque plusieurs utilisateurs l'utilisent.",
    "subtitle1": "Analyse",
    "subtitle1Text1": "Connaître les exigences du client",
    "subtitle1Text2": "Rédiger le dossier des spécifications fonctionnelles et techniques (ex : Vue Cas d'utilisation, Vue Logique (fonctionnelle), Vue Réalisation, Vue Déploiement, ...)",
    "subtitle1Text3": "Créer un lean canvas",
    "subtitle2": "Conception",
    "subtitle2Text1": "L'outil de wireframing, Uxpin, a été utilisé pour créer la maquette",
    "subtitle2Text2": "La séquence des écrans du site a été réalisée à l'aide de draw.io",
    "subtitle2Text3": "L'accessibilité et la sécurité ont été prises en compte lors de la conception",
    "subtitle2Text4": "Le tableau des tâches Kanban de Notion a été utilisé pour gérer les user stories",
    "subtitle3": "Code",
    "subtitle4": "Tests",
    "subtitle4Text1": "<span class='font-semibold'>Tests structurels :</span> Jest & JUnit 5 (Jacoco pour la couverture de code)",
    "subtitle4Text2": "<span class='font-semibold'>Tests fonctionnels :</span> Nightwatch",
    "subtitle4Text3": "<span class='font-semibold'>Tests de performance :</span> JMeter & Lighthouse",
    "subtitle4Text4": "<span class='font-semibold'>Tests de sécurité :</span> Guide OWASP & OWASP ZAP",
    "subtitle4Text5": "<span class='font-semibold'>Tests qualité :</span> SonarQube",
    "subtitle4Text6": "<span class='font-semibold'>Tests utilisateur :</span>  Questionnaires pour les administrateurs et les non-administrateurs",
    "subtitle5": "Mise en œuvre",
    "subtitle5Text1": "CI/CD avec GitLab",
    "subtitle5Text2": "Déployé en production avec Harbore & Rundeck",
    "positive": "😀 Ce que j'ai aimé avec ce projet",
    "positivetext1": "Création de l'application web à partir de zéro",
    "positivetext2": "Apprendre de nouvelles technologies et outils (WebSocket, Vuex store, Vue i18n, etc.)",
    "positivetext3": "En apprendre plus sur les tests",
    "improvement": "🤔 Ce que j'aimerais faire mieux la prochaine fois",
    "improvementText1": "Mieux respecter la méthode TDD tout au long du projet"
  },
  "planning-android": {
    "title": "Projet Entreprise - Application de planification Android (Java)",
    "issueText": "Les employés non administratifs n'avaient pas facilement accès à leur planning pour savoir quand ils devaient enseigner.",
    "solutionText": "Création d'une application mobile pour connaître la liste des formations du salarié connecté, voir le détail de ses formations et possibilité de synchroniser une formation avec son agenda.",
    "subtitle1": "Analyse",
    "subtitle1Text1": "Connaître les exigences du client",
    "subtitle1Text2": "Rédiger le dossier de spécifications fonctionnelles et techniques (ex : Vue Cas d'utilisation, Vue Logique (fonctionnelle), Vue Réalisation, Vue Déploiement, ...)",
    "subtitle1Text3": "Créer un lean canvas",
    "subtitle2": "Conception",
    "subtitle2Text1": "L'outil de wireframing, Figma, a été utilisé pour créer la maquette",
    "subtitle2Text2": "L'accessibilité et la sécurité ont été prises en compte lors de la conception",
    "subtitle2Text3": "Le tableau des tâches Kanban de Notion a été utilisé pour gérer les user stories",
    "subtitle3": "Code",
    "subtitle4": "Tests",
    "subtitle4Text1": "<span class='font-semibold'>Tests structurels :</span> JUnit 5 (Jacoco pour la couverture de code)",
    "subtitle4Text2": "<span class='font-semibold'>Tests de performances :</span> JMeter",
    "subtitle4Text3": "<span class='font-semibold'>Tests de sécurité :</span> Guide OWASP & OWASP ZAP",
    "subtitle4Text4": "<span class='font-semibold'>Test de qualité </span> SonarQube",
    "subtitle4Text5": "<span class='font-semibold'>Tests utilisateur :</span>  Questionnaires pour les administrateurs et les non-administrateurs",
    "subtitle5": "Mise en œuvre",
    "subtitle5Text1": "CI/CD avec GitLab",
    "subtitle5Text2": "Création d'un lien pour télécharger l'APK",
    "subtitle5Text3": "Rédaction d'un guide utilisateur",
    "positive": "😀 Ce que j'ai aimé avec ce projet",
    "positivetext1": "Création d'une application Android à partir de zéro",
    "positivetext2": "Interagir avec les autres applications du téléphone",
    "positivetext3": "Améliorer les performances d'une application",
    "improvement": "🤔 Ce que j'aimerais faire mieux la prochaine fois",
    "improvementText1": "Pourrait respecter une meilleure méthode Agile"
  }
}